{
  "dwango": {
    "name": "株式会社ドワンゴ",
    "url": "http://dwango.co.jp/",
    "pr": "株式会社ドワンゴは、ゲームや音楽をはじめとするエンタテインメント分野において、次世代ネットワークコミュニケーションの創出を目指す、ネットワーク・エンタテインメント・カンパニーです。 5,000万人を超える登録ユーザー数を誇る国内最大級の動画サイト「niconico（ニコニコ動画）」の運営をはじめ、モバイル向け音楽配信、ゲームソフト及びオンラインゲームの企画・開発・販売などを行っています。 高度なネットワーク技術と独創的な発想を強みに、良質なコンテンツを様々なプラットフォームに提供しています。"
  },
  "r-tech": {
    "name": "リクルートテクノロジーズ",
    "url": "http://recruit-tech.co.jp/",
    "pr": "株式会社リクルートテクノロジーズはリクルートグループのIT開発基盤を担う会社です。リクルートグループ各社のニーズを見据えて競合優位性の高いIT基盤を開拓、実装することにより、競争優位を構築していきます。現在は、 Universal JavaScript を活用した新しい Web アプリケーションの開発、 Push通知基盤などにも Node.js を活用しており、積極的に導入しております。今後も Node.js を活用したアプリケーションの開発を行う予定です。"
  },
  "mercari": {
    "name": "株式会社メルカリ",
    "url": "https://www.mercari.com/jp/",
    "pr": "私たちのミッションは”新たな価値を生みだす世界的なマーケットプレイスを創る”ことです。このミッションを達成するために、「Go Bold – 大胆にやろう」、 「All for One – 全ては成功のために」、「Be Professional – プロフェッショナルであれ」、 という3つのValueのもと、フリマアプリ「メルカリ」をはじめ、地域コミュニティアプリ「メルカリ アッテ」、本・CD・DVD専用フリマアプリ「メルカリ カウル」のサービス開発に全力で取り組んでいます！"
  },
  "yahoo": {
    "name": "株式会社ヤフー",
    "url": "https://www.yahoo.co.jp/",
    "pr": "Yahoo! JAPANは、100以上のサービスを通じて日々蓄積され続ける「マルチビッグデータ」の解析によって、ユーザーの生活を知り、繊細な気持ちまで汲み取ります。 そして、月間約700億PV・約4千万ユニークユーザーIDものスケールで収集されたデータから各個人にフィットするパーソナライズされた情報を提供し、人々の生活の可能性を広げていきます。私たちは、世の中のあらゆる課題解決を図り、日本に新しいイノベーションを実現する「データドリブン企業」として、人々の毎日の生活に便利さと幸せをもたらしていきます。"
  },
  "nissan": {
    "name": "日産自動車株式会社",
    "url": "https://www.wantedly.com/projects/156247",
    "pr": "その手で自動車の未来を変えたいソフトウェアエンジニア募集！世界中の人の生活を変えるチャンスがあるのは日産だけ！"
  },
  "auth0": {
    "name": "Auth0® Inc.",
    "url": "https://auth0.com/jp/",
    "pr": "クラウドの認証・認可プラットフォームAuth0を活用し、User Experienceを向上させませんか？既存のウェブサイト、モバイルアプリケーションにソーシャルログイン、パスワードレス認証、生体認証、多要素認証を簡単に実装可能です。豊富なSDKとドキュメンテーションにより大幅な開発期間の短縮が可能です。"
  },
  "pxgrid": {
    "name": "株式会社ピクセルグリッド",
    "url": "https://www.pxgrid.com/",
    "pr": "株式会社ピクセルグリッドは、JavaScriptの会社です。スタッフの多くは技術関連の著書があり、技術者向けの講演などをこなすフロントエンド・エンジニアです。フロントエンド技術に特化し、JavaScriptとHTML5などの技術を使った制作を得意としています。Single Page Applicationのフロントエンド設計や実装、大規模Webサイトの設計およびテンプレート制作、Webアプリケーションの制作など、お気軽にご相談ください。"
  },
  "cyberagent": {
    "name": "株式会社サイバーエージェント",
    "url": "https://www.cyberagent.co.jp/",
    "pr": "1998年設立。日本のインターネット業界黎明期より、業界を牽引する会社の一つとして、事業を拡大。 現在はインターネットテレビ「AbemaTV」、定額制音楽配信サービス「AWA」、国内最大のブログサービス「Ameba」などを運営するほか、インターネット広告代理店として国内売上高No.1、スマートフォンゲームにおいても国内有数の企業として、日本を代表するインターネット企業の1社となっている。"
  },
  "tsukuruba": {
    "name": "株式会社ツクルバ",
    "url": "http://tsukuruba.com/",
    "pr": "ツクルバは、実空間と情報空間を横断した場づくりを実践する、場の発明カンパニーです。シェアードワークプレイス「co-ba（コーバ）」、リノベーション住宅特化の流通プラットフォーム「cowcamo（カウカモ）」に加え、社内組織「tsukuruba design」にて空間プロデュース・デザイン業を展開。「『場』の発明を通じて欲しい未来をつくる」というミッションのもと、建築・不動産・テクノロジーをかけあわせた場のデザインを行っています。"
  },
  "freee": {
    "name": "freee株式会社",
    "url": "https://www.freee.co.jp/",
    "pr": "「スモールビジネスに携わるすべての人が創造的な活動にフォーカスできるよう」をミッションに掲げ、2012年7月に創業。個人事業主や中堅・中小企業を対象に、有効事業所数80万超の「クラウド会計ソフト freee」、同10万超の「人事労務 freee」、「会社設立 freee」等を提供。クラウド会計および給与計算の分野でシェア1位を獲得。ビジネスの始まりから成長までをサポートし、バックオフィス業務の最適化に尽力。"
  },
  "cybozu": {
    "name": "サイボウズ株式会社",
    "url": "https://kintone.cybozu.com/jp/",
    "pr": "サイボウズは業務アプリ開発プラットフォーム「kintone」をはじめとする、チーム・コラボレーションを支援するクラウドサービスを開発・提供しています。グローバルに拠点をもつ企業や公共団体などの大規模チームから、企業間プロジェクト、ボランティア、家族などの小規模チームまで幅広いお客様にご利用いただいています。"
  },
  "gms": {
    "name": "Global Mobility Service株式会社",
    "url": "http://global-mobility-service.com/",
    "pr": "Global Mobility Service株式会社は、モビリティーサービスの提供を通じ、多くの人々を幸せにしたいと考えています。クルマありきの社会から、社会ありきのクルマへ。クルマだけでは決して人を幸せにできません。クルマを必要とする社会を第一に考え人とクルマの関わり方を私たちが変えていきたいと考えています。電気自動車業界で培った技術と経験をベースに独自開発したデバイス、およびそこからセンシングされた各種情報を、nodeJSを中心として構築されたIoTプラットフォームへ集約し、そのデータを利用したサービスを提供させて頂くことによって、モビリティ社会に多くの可能性を与え、日本の優れた技術を統合し、世界市場に貢献したいと考えております。"
  },
  "r-life": {
    "name": "株式会社リクルートライフスタイル",
    "url": "https://www.recruit-lifestyle.co.jp/",
    "pr": "旅行領域、飲食領域、美容領域、ヘルスケア領域、通販・割引チケット共同購入サービス、その他日常消費領域に関わるカスタマーの行動支援およびクライアントの業務支援・決済サービスの提供をしております。"
  },
  "supership": {
    "name": "Supership株式会社",
    "url": "https://supership.jp/",
    "pr": "当社は、「すべてが相互につながる『よりよい世界』を実現する」という理念のもと、広告事業・インターネットサービス事業・プラットフォーム事業等の事業基盤を活かした新たな価値の提供を目指すKDDIのグループ会社です。今後、スマートフォン最大規模の顧客接点とデータ利活用により、お客さまのご期待に応える新たなサービスを提供していきます。"
  },
  "sphinx": {
    "name": "Sphinx",
    "url": "http://www.sphinx-software.com/",
    "pr": "Sphinxは、ベトナムで大規模なJavaScriptの技術者コミュニティを運営している、最先端の技術を持つチームです。世界のNode.JS組織のシルバーメンバーであり、ベトナムにおけるAngular JSおよびNode.JSコミュニティの創設者でもあります。"
  },
  "stickermule": {
    "name": "Sticker Mule",
    "url": "https://www.stickermule.com/uses/laptop-stickers",
    "pr": "Sticker Mule は、カスタムステッカーをもっとも簡単に購入できるサービスです。 100％のリモートチームによって推進され、8カ国で事業を展開しており、毎年世界中で50,000以上の顧客に出荷しています。無料のオンライン証明書、世界中の無料配送、24時間365日のカスタマーサポートを提供しています。"
  },
  "hosei": {
    "name": "法政大学情報科学部",
    "url": "http://cis.hosei.ac.jp/",
    "pr": "情報科学部は、情報科学に関する最先端の専門的知識・技術の修得だけでなく、次から次へ新しい概念と技術を創造し、世界を舞台に情報化社会をリードしてゆく技術者・研究者を最新の教育環境のもとで育成していきます。"
  }
}
