{
  "paypal": {
    "name": "PayPal",
    "url": "https://www.paypal.com/jp/webapps/mpp/merchant",
    "pr": "ペイパルは、いままでにないオンライン決済サービスでショッピングとビジネスの未来をカタチにするイノベーターです。時代のニーズに合わせた、よりかんたんで安心な決済サービスを提案し、世界中のショッピングとビジネスをシンプルに変えていきます。"
  },

  "dwango": {
    "name": "株式会社ドワンゴ",
    "url": "http://dwango.co.jp/",
    "pr": "株式会社ドワンゴは、ゲームや音楽をはじめとするエンタテインメント分野において、次世代ネットワークコミュニケーションの創出を目指す、ネットワーク・エンタテインメント・カンパニーです。 5,000万人を超える登録ユーザー数を誇る国内最大級の動画サイト「niconico（ニコニコ動画）」の運営をはじめ、モバイル向け音楽配信、ゲームソフト及びオンラインゲームの企画・開発・販売などを行っています。 高度なネットワーク技術と独創的な発想を強みに、良質なコンテンツを様々なプラットフォームに提供しています。"
  },
  "r-tech": {
    "name": "リクルートテクノロジーズ",
    "url": "http://recruit-tech.co.jp/",
    "pr": "株式会社リクルートテクノロジーズはリクルートグループのIT開発基盤を担う会社です。リクルートグループ各社のニーズを見据えて競合優位性の高いIT基盤を開拓、実装することにより、競争優位を構築していきます。現在は、 Universal JavaScript を活用した新しい Web アプリケーションの開発、 Push通知基盤などにも Node.js を活用しており、積極的に導入しております。今後も Node.js を活用したアプリケーションの開発を行う予定です。"
  },
  "yahoo": {
    "name": "ヤフー株式会社",
    "url": "http://www.yahoo.co.jp/",
    "pr": "日本最大級のインターネットの総合情報サイト「Yahoo! JAPAN」を運営するヤフー株式会社は、ITを使って人々や社会のさまざまな「課題」を解決していく「課題解決エンジン」として、いろいろな取り組みを進めています。"
  },

  "pxgrid": {
    "name": "株式会社ピクセルグリッド",
    "url": "https://www.pxgrid.com/",
    "pr": "株式会社ピクセルグリッドは、JavaScriptの会社です。スタッフの多くは技術関連の著書があり、技術者向けの講演などをこなすフロントエンド・エンジニアです。フロントエンド技術に特化し、JavaScriptとHTML5などの技術を使った制作を得意としています。Single Page Applicationのフロントエンド設計や実装、大規模Webサイトの設計およびテンプレート制作、Webアプリケーションの制作など、お気軽にご相談ください。"
  },
  "sphinx": {
    "name": "Sphinx有限会社",
    "url": "http://sphinx-software.jp/",
    "pr": "会社概要:弊社はベトナムでのJavaScript 及びMEAN スタックの業界でトップであり、開発において5~10年以上の 経験を持ち、 Node.JS, React.JS, Sail.JS,D3.JS, Meteor, AngularJS, Angular 2等の開発言語及びスクラム、XP、TDD、DDD等アジャイルソフトウェア開発ツールキットの開発を行って来ました。"
  },
  "cyberagent": {
    "name": "株式会社サイバーエージェント",
    "url": "https://www.cyberagent.co.jp/",
    "pr": "1998年設立。日本のインターネット業界黎明期より、業界を牽引する会社の一つとして、事業を拡大。 現在はインターネットテレビ「AbemaTV」、定額制音楽配信サービス「AWA」、国内最大のブログサービス「Ameba」などを運営するほか、インターネット広告代理店として国内売上高No.1、スマートフォンゲームにおいても国内有数の企業として、日本を代表するインターネット企業の1社となっている。"
  },
  "opt": {
    "name": "株式会社オプト",
    "url": "http://www.opt.ne.jp/opttechnologies/",
    "pr": "株式会社オプトは持続的な成長を志す企業に対してマーケティング×テクノロジーのパートナーとなる「eマーケティングカンパニー」です。 今年は 'Opt Technologies' というエンジニア組織を立ち上げ、より技術を強化しております。フロントエンドについては、 node を開発ツールの中心に据え、Angular , React, TypeScript などを利用した開発を進めています。（サーバサイドは Scala や Ruby です）"
  },
  "uniba": {
    "name": "UNIBA INC.",
    "url": "http://uniba.jp/",
    "pr": "渋谷区でウェブ制作を行っている、17名の小さなプロダクションです。プロモーションや、キャンペーン、ブランディングの制作や、ウェブのシステム開発を行っています。特に、新しい製品のプロトタイプや実験的なイベントなど、技術的に新しい領域で積極的に活動しています。現在は、サーバサイドのシステム、スマートフォンアプリ、デジタルサイネージ、ハードウェアの開発も行っています。 ウェブを中心にしながら、年々ツールやアイディアをアップデートして、そのときにやりがいのある領域を求めて活動しています。コマーシャルな領域以外には、ウェブ関連の技術勉強会を開催したり、Maker Fairへの参加、東京Node学園祭へのスポンサード、アートプロジェクトへの参加など、技術コミュニティやアートコミュニティの一員としての活動も積極的に行っています。"
  },
  "nifty": {
    "name": "ニフティ株式会社",
    "url": "http://iot.nifty.com/",
    "pr": "ニフティのIoTは、お客様の望む「IoT」を実現するためのプロトタイピング開発と、汎用的なIoTプラットフォーム開発の2軸から成り立っています。プロトタイピングではReact.jsやNode.jsでのSPAダッシュボードやデバイスファームウェアの開発、プラットフォームでは機械学習を用いた分析やDockerでのサービス運用など、幅広いレイヤーの技術を駆使し高速に開発し、価値の検証をしています。"
  },

  "theport": {
    "name": "ポート株式会社",
    "url": "https://www.theport.jp/",
    "pr": "先日、シリーズBで9億円の資金調達を完了した、創業6年目の成長ベンチャーであるPORT  INC.のミッションは、「世界中に、アタリマエとシアワセを」です。そのために、「テクノロジー×リアル産業」にドメインを置き、ビックビジネスを仕掛ける会社です。世の中に「あったらいいな」ではなく「なくてはならない」といわれる、革新的なプロダクトを生み出すことで、社会課題に対して、「提言」ではなく、「実行」する会社です。"
  },
  "qrio": {
    "name": "Qrio株式会社",
    "url": "http://qrioinc.com/",
    "pr": "Qrio株式会社は、インターネットビジネスに精通したベンチャーキャピタルのWiLと、世界的な電機メーカーのソニーとのジョイントベンチャーとして設立されました。大企業のものづくりのノウハウと、ベンチャー企業のインターネット知識とスピード感を最大限に活かし、これまでにないユニークな商品を世に送り出していく会社です。Qrio Smart Lockだけでなく、Qrio Smart Tagを新たなサービスと加えた今、ものづくりとインターネットの力で世界をもっと便利に変えていきます。"
  },
  "goodpatch": {
    "name": "株式会社グッドパッチ",
    "url": "http://goodpatch.com/jp",
    "pr": "グッドパッチは、ユーザーインターフェース（以下UI）デザイン・設計に特化したデザインカンパニーです。サービスのコンセプトデザイン段階から実装までワンストップで提供しています。これまでにはキュレーションアプリ「MERY」、集中力を測定するアプリ「JINS MEME OFFICE」、チケット売買アプリ「チケットキャンプ」など様々なデザインを手がけてきました。また自社製品のプロトタイピングツール「Prott」は世界140ヶ国以上で利用され、デザインプロセスに変革をもたらしています。"
  },
  "lig": {
    "name": "株式会社LIG",
    "url": "https://liginc.co.jp/",
    "pr": "月間600万PVを超える自社メディアの運営を行っている台東区上野にあるウェブ制作会社です。メディア制作を得意とし、サイト制作だけでなく記事制作や運営コンサルティング、運用保守などメディア運営に必要なすべてをワンストップで請け負っています。またおもしろコンテンツ制作を通した記事広告の制作も承っています。"
  }
}
